Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.61/samv70b/include/component/mlb.h
/* -------- MLB_MSD : (MLB Offset: 0x24) ( R/ 32) MediaLB System Data Register -------- */
#define MLB_MSD_SD0_Pos                       _U_(0)                                               /**< (MLB_MSD) System Data (Byte 0) Position */
#define MLB_MSD_SD0_Msk                       (_U_(0xFF) << MLB_MSD_SD0_Pos)                       /**< (MLB_MSD) System Data (Byte 0) Mask */
#define MLB_MSD_SD0(value)                    (MLB_MSD_SD0_Msk & ((value) << MLB_MSD_SD0_Pos))    
#define MLB_MSD_SD1_Pos                       _U_(8)                                               /**< (MLB_MSD) System Data (Byte 1) Position */
#define MLB_MSD_SD1_Msk                       (_U_(0xFF) << MLB_MSD_SD1_Pos)                       /**< (MLB_MSD) System Data (Byte 1) Mask */
#define MLB_MSD_SD1(value)                    (MLB_MSD_SD1_Msk & ((value) << MLB_MSD_SD1_Pos))    
#define MLB_MSD_SD2_Pos                       _U_(16)                                              /**< (MLB_MSD) System Data (Byte 2) Position */
#define MLB_MSD_SD2_Msk                       (_U_(0xFF) << MLB_MSD_SD2_Pos)                       /**< (MLB_MSD) System Data (Byte 2) Mask */
#define MLB_MSD_SD2(value)                    (MLB_MSD_SD2_Msk & ((value) << MLB_MSD_SD2_Pos))    
#define MLB_MSD_SD3_Pos                       _U_(24)                                              /**< (MLB_MSD) System Data (Byte 3) Position */
#define MLB_MSD_SD3_Msk                       (_U_(0xFF) << MLB_MSD_SD3_Pos)                       /**< (MLB_MSD) System Data (Byte 3) Mask */
#define MLB_MSD_SD3(value)                    (MLB_MSD_SD3_Msk & ((value) << MLB_MSD_SD3_Pos))    
#define MLB_MSD_Msk                           _U_(0xFFFFFFFF)                                      /**< (MLB_MSD) Register Mask  */


/* -------- MLB_MIEN : (MLB Offset: 0x2C) (R/W 32) MediaLB Interrupt Enable Register -------- */
#define MLB_MIEN_ISOC_PE_Pos                  _U_(0)                                               /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ISOC_PE_Msk                  (_U_(0x1) << MLB_MIEN_ISOC_PE_Pos)                   /**< (MLB_MIEN) Isochronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ISOC_PE(value)               (MLB_MIEN_ISOC_PE_Msk & ((value) << MLB_MIEN_ISOC_PE_Pos))
#define MLB_MIEN_ISOC_BUFO_Pos                _U_(1)                                               /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Position */
#define MLB_MIEN_ISOC_BUFO_Msk                (_U_(0x1) << MLB_MIEN_ISOC_BUFO_Pos)                 /**< (MLB_MIEN) Isochronous Rx Buffer Overflow Enable Mask */
#define MLB_MIEN_ISOC_BUFO(value)             (MLB_MIEN_ISOC_BUFO_Msk & ((value) << MLB_MIEN_ISOC_BUFO_Pos))
#define MLB_MIEN_SYNC_PE_Pos                  _U_(16)                                              /**< (MLB_MIEN) Synchronous Protocol Error Enable Position */
#define MLB_MIEN_SYNC_PE_Msk                  (_U_(0x1) << MLB_MIEN_SYNC_PE_Pos)                   /**< (MLB_MIEN) Synchronous Protocol Error Enable Mask */
#define MLB_MIEN_SYNC_PE(value)               (MLB_MIEN_SYNC_PE_Msk & ((value) << MLB_MIEN_SYNC_PE_Pos))
#define MLB_MIEN_ARX_DONE_Pos                 _U_(17)                                              /**< (MLB_MIEN) Asynchronous Rx Done Enable Position */
#define MLB_MIEN_ARX_DONE_Msk                 (_U_(0x1) << MLB_MIEN_ARX_DONE_Pos)                  /**< (MLB_MIEN) Asynchronous Rx Done Enable Mask */
#define MLB_MIEN_ARX_DONE(value)              (MLB_MIEN_ARX_DONE_Msk & ((value) << MLB_MIEN_ARX_DONE_Pos))
#define MLB_MIEN_ARX_PE_Pos                   _U_(18)                                              /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Position */
#define MLB_MIEN_ARX_PE_Msk                   (_U_(0x1) << MLB_MIEN_ARX_PE_Pos)                    /**< (MLB_MIEN) Asynchronous Rx Protocol Error Enable Mask */
#define MLB_MIEN_ARX_PE(value)                (MLB_MIEN_ARX_PE_Msk & ((value) << MLB_MIEN_ARX_PE_Pos))
#define MLB_MIEN_ARX_BREAK_Pos                _U_(19)                                              /**< (MLB_MIEN) Asynchronous Rx Break Enable Position */
#define MLB_MIEN_ARX_BREAK_Msk                (_U_(0x1) << MLB_MIEN_ARX_BREAK_Pos)                 /**< (MLB_MIEN) Asynchronous Rx Break Enable Mask */
#define MLB_MIEN_ARX_BREAK(value)             (MLB_MIEN_ARX_BREAK_Msk & ((value) << MLB_MIEN_ARX_BREAK_Pos))
#define MLB_MIEN_ATX_DONE_Pos                 _U_(20)                                              /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Position */
#define MLB_MIEN_ATX_DONE_Msk                 (_U_(0x1) << MLB_MIEN_ATX_DONE_Pos)                  /**< (MLB_MIEN) Asynchronous Tx Packet Done Enable Mask */
#define MLB_MIEN_ATX_DONE(value)              (MLB_MIEN_ATX_DONE_Msk & ((value) << MLB_MIEN_ATX_DONE_Pos))
#define MLB_MIEN_ATX_PE_Pos                   _U_(21)                                              /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Position */
#define MLB_MIEN_ATX_PE_Msk                   (_U_(0x1) << MLB_MIEN_ATX_PE_Pos)                    /**< (MLB_MIEN) Asynchronous Tx Protocol Error Enable Mask */
#define MLB_MIEN_ATX_PE(value)                (MLB_MIEN_ATX_PE_Msk & ((value) << MLB_MIEN_ATX_PE_Pos))
#define MLB_MIEN_ATX_BREAK_Pos                _U_(22)                                              /**< (MLB_MIEN) Asynchronous Tx Break Enable Position */
#define MLB_MIEN_ATX_BREAK_Msk                (_U_(0x1) << MLB_MIEN_ATX_BREAK_Pos)                 /**< (MLB_MIEN) Asynchronous Tx Break Enable Mask */
#define MLB_MIEN_ATX_BREAK(value)             (MLB_MIEN_ATX_BREAK_Msk & ((value) << MLB_MIEN_ATX_BREAK_Pos))
#define MLB_MIEN_CRX_DONE_Pos                 _U_(24)                                              /**< (MLB_MIEN) Control Rx Packet Done Enable Position */
#define MLB_MIEN_CRX_DONE_Msk                 (_U_(0x1) << MLB_MIEN_CRX_DONE_Pos)                  /**< (MLB_MIEN) Control Rx Packet Done Enable Mask */
#define MLB_MIEN_CRX_DONE(value)              (MLB_MIEN_CRX_DONE_Msk & ((value) << MLB_MIEN_CRX_DONE_Pos))
#define MLB_MIEN_CRX_PE_Pos                   _U_(25)                                              /**< (MLB_MIEN) Control Rx Protocol Error Enable Position */
#define MLB_MIEN_CRX_PE_Msk                   (_U_(0x1) << MLB_MIEN_CRX_PE_Pos)                    /**< (MLB_MIEN) Control Rx Protocol Error Enable Mask */
#define MLB_MIEN_CRX_PE(value)                (MLB_MIEN_CRX_PE_Msk & ((value) << MLB_MIEN_CRX_PE_Pos))
#define MLB_MIEN_CRX_BREAK_Pos                _U_(26)                                              /**< (MLB_MIEN) Control Rx Break Enable Position */
#define MLB_MIEN_CRX_BREAK_Msk                (_U_(0x1) << MLB_MIEN_CRX_BREAK_Pos)                 /**< (MLB_MIEN) Control Rx Break Enable Mask */
#define MLB_MIEN_CRX_BREAK(value)             (MLB_MIEN_CRX_BREAK_Msk & ((value) << MLB_MIEN_CRX_BREAK_Pos))
#define MLB_MIEN_CTX_DONE_Pos                 _U_(27)                                              /**< (MLB_MIEN) Control Tx Packet Done Enable Position */
#define MLB_MIEN_CTX_DONE_Msk                 (_U_(0x1) << MLB_MIEN_CTX_DONE_Pos)                  /**< (MLB_MIEN) Control Tx Packet Done Enable Mask */
#define MLB_MIEN_CTX_DONE(value)              (MLB_MIEN_CTX_DONE_Msk & ((value) << MLB_MIEN_CTX_DONE_Pos))
#define MLB_MIEN_CTX_PE_Pos                   _U_(28)                                              /**< (MLB_MIEN) Control Tx Protocol Error Enable Position */
#define MLB_MIEN_CTX_PE_Msk                   (_U_(0x1) << MLB_MIEN_CTX_PE_Pos)                    /**< (MLB_MIEN) Control Tx Protocol Error Enable Mask */
#define MLB_MIEN_CTX_PE(value)                (MLB_MIEN_CTX_PE_Msk & ((value) << MLB_MIEN_CTX_PE_Pos))
#define MLB_MIEN_CTX_BREAK_Pos                _U_(29)                                              /**< (MLB_MIEN) Control Tx Break Enable Position */
#define MLB_MIEN_CTX_BREAK_Msk                (_U_(0x1) << MLB_MIEN_CTX_BREAK_Pos)                 /**< (MLB_MIEN) Control Tx Break Enable Mask */
#define MLB_MIEN_CTX_BREAK(value)             (MLB_MIEN_CTX_BREAK_Msk & ((value) << MLB_MIEN_CTX_BREAK_Pos))
#define MLB_MIEN_Msk                          _U_(0x3F7F0003)                                      /**< (MLB_MIEN) Register Mask  */


/* -------- MLB_MLBC1 : (MLB Offset: 0x3C) (R/W 32) MediaLB Control 1 Register -------- */
#define MLB_MLBC1_LOCK_Pos                    _U_(6)                                               /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Position */
#define MLB_MLBC1_LOCK_Msk                    (_U_(0x1) << MLB_MLBC1_LOCK_Pos)                     /**< (MLB_MLBC1) MediaLB Lock Error Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_LOCK(value)                 (MLB_MLBC1_LOCK_Msk & ((value) << MLB_MLBC1_LOCK_Pos))
#define MLB_MLBC1_CLKM_Pos                    _U_(7)                                               /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Position */
#define MLB_MLBC1_CLKM_Msk                    (_U_(0x1) << MLB_MLBC1_CLKM_Pos)                     /**< (MLB_MLBC1) MediaLB Clock Missing Status (cleared by writing a 0) Mask */
#define MLB_MLBC1_CLKM(value)                 (MLB_MLBC1_CLKM_Msk & ((value) << MLB_MLBC1_CLKM_Pos))
#define MLB_MLBC1_NDA_Pos                     _U_(8)                                               /**< (MLB_MLBC1) Node Device Address Position */
#define MLB_MLBC1_NDA_Msk                     (_U_(0xFF) << MLB_MLBC1_NDA_Pos)                     /**< (MLB_MLBC1) Node Device Address Mask */
#define MLB_MLBC1_NDA(value)                  (MLB_MLBC1_NDA_Msk & ((value) << MLB_MLBC1_NDA_Pos))
#define MLB_MLBC1_Msk                         _U_(0x0000FFC0)                                      /**< (MLB_MLBC1) Register Mask  */


