Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.3.61/samv70b/include/component/mlb.h
/* -------- MLB_HCTL : (MLB Offset: 0x80) (R/W 32) HBI Control Register -------- */
#define MLB_HCTL_RST0_Pos                     _U_(0)                                               /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Position */
#define MLB_HCTL_RST0_Msk                     (_U_(0x1) << MLB_HCTL_RST0_Pos)                      /**< (MLB_HCTL) Address Generation Unit 0 Software Reset Mask */
#define MLB_HCTL_RST0(value)                  (MLB_HCTL_RST0_Msk & ((value) << MLB_HCTL_RST0_Pos))
#define MLB_HCTL_RST1_Pos                     _U_(1)                                               /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Position */
#define MLB_HCTL_RST1_Msk                     (_U_(0x1) << MLB_HCTL_RST1_Pos)                      /**< (MLB_HCTL) Address Generation Unit 1 Software Reset Mask */
#define MLB_HCTL_RST1(value)                  (MLB_HCTL_RST1_Msk & ((value) << MLB_HCTL_RST1_Pos))
#define MLB_HCTL_EN_Pos                       _U_(15)                                              /**< (MLB_HCTL) HBI Enable Position */
#define MLB_HCTL_EN_Msk                       (_U_(0x1) << MLB_HCTL_EN_Pos)                        /**< (MLB_HCTL) HBI Enable Mask */
#define MLB_HCTL_EN(value)                    (MLB_HCTL_EN_Msk & ((value) << MLB_HCTL_EN_Pos))    
#define MLB_HCTL_Msk                          _U_(0x00008003)                                      /**< (MLB_HCTL) Register Mask  */

#define MLB_HCTL_RST_Pos                      _U_(0)                                               /**< (MLB_HCTL Position) Address Generation Unit x Software Reset */
#define MLB_HCTL_RST_Msk                      (_U_(0x3) << MLB_HCTL_RST_Pos)                       /**< (MLB_HCTL Mask) RST */
#define MLB_HCTL_RST(value)                   (MLB_HCTL_RST_Msk & ((value) << MLB_HCTL_RST_Pos))   

/* -------- MLB_HCMR : (MLB Offset: 0x88) (R/W 32) HBI Channel Mask 0 Register 0 -------- */
#define MLB_HCMR_CHM_Pos                      _U_(0)                                               /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Position */
#define MLB_HCMR_CHM_Msk                      (_U_(0xFFFFFFFF) << MLB_HCMR_CHM_Pos)                /**< (MLB_HCMR) Bitwise Channel Mask Bit [31:0] Mask */
#define MLB_HCMR_CHM(value)                   (MLB_HCMR_CHM_Msk & ((value) << MLB_HCMR_CHM_Pos))  
#define MLB_HCMR_Msk                          _U_(0xFFFFFFFF)                                      /**< (MLB_HCMR) Register Mask  */


/* -------- MLB_HCER : (MLB Offset: 0x90) ( R/ 32) HBI Channel Error 0 Register 0 -------- */
#define MLB_HCER_CERR_Pos                     _U_(0)                                               /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Position */
#define MLB_HCER_CERR_Msk                     (_U_(0xFFFFFFFF) << MLB_HCER_CERR_Pos)               /**< (MLB_HCER) Bitwise Channel Error Bit [31:0] Mask */
#define MLB_HCER_CERR(value)                  (MLB_HCER_CERR_Msk & ((value) << MLB_HCER_CERR_Pos))
#define MLB_HCER_Msk                          _U_(0xFFFFFFFF)                                      /**< (MLB_HCER) Register Mask  */


/* -------- MLB_HCBR : (MLB Offset: 0x98) ( R/ 32) HBI Channel Busy 0 Register 0 -------- */
#define MLB_HCBR_CHB_Pos                      _U_(0)                                               /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Position */
#define MLB_HCBR_CHB_Msk                      (_U_(0xFFFFFFFF) << MLB_HCBR_CHB_Pos)                /**< (MLB_HCBR) Bitwise Channel Busy Bit [31:0] Mask */
#define MLB_HCBR_CHB(value)                   (MLB_HCBR_CHB_Msk & ((value) << MLB_HCBR_CHB_Pos))  
#define MLB_HCBR_Msk                          _U_(0xFFFFFFFF)                                      /**< (MLB_HCBR) Register Mask  */


/* -------- MLB_MDAT : (MLB Offset: 0xC0) (R/W 32) MIF Data 0 Register 0 -------- */
#define MLB_MDAT_DATA_Pos                     _U_(0)                                               /**< (MLB_MDAT) CRT or DBR Data Position */
#define MLB_MDAT_DATA_Msk                     (_U_(0xFFFFFFFF) << MLB_MDAT_DATA_Pos)               /**< (MLB_MDAT) CRT or DBR Data Mask */
#define MLB_MDAT_DATA(value)                  (MLB_MDAT_DATA_Msk & ((value) << MLB_MDAT_DATA_Pos))
#define MLB_MDAT_Msk                          _U_(0xFFFFFFFF)                                      /**< (MLB_MDAT) Register Mask  */


/* -------- MLB_MDWE : (MLB Offset: 0xD0) (R/W 32) MIF Data Write Enable 0 Register 0 -------- */
#define MLB_MDWE_MASK_Pos                     _U_(0)                                               /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Position */
#define MLB_MDWE_MASK_Msk                     (_U_(0xFFFFFFFF) << MLB_MDWE_MASK_Pos)               /**< (MLB_MDWE) Bitwise Write Enable for CTR Data - bits[31:0] Mask */
#define MLB_MDWE_MASK(value)                  (MLB_MDWE_MASK_Msk & ((value) << MLB_MDWE_MASK_Pos))
#define MLB_MDWE_Msk                          _U_(0xFFFFFFFF)                                      /**< (MLB_MDWE) Register Mask  */


/* -------- MLB_MCTL : (MLB Offset: 0xE0) (R/W 32) MIF Control Register -------- */
#define MLB_MCTL_XCMP_Pos                     _U_(0)                                               /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Position */
#define MLB_MCTL_XCMP_Msk                     (_U_(0x1) << MLB_MCTL_XCMP_Pos)                      /**< (MLB_MCTL) Transfer Complete (Write 0 to Clear) Mask */
#define MLB_MCTL_XCMP(value)                  (MLB_MCTL_XCMP_Msk & ((value) << MLB_MCTL_XCMP_Pos))
#define MLB_MCTL_Msk                          _U_(0x00000001)                                      /**< (MLB_MCTL) Register Mask  */


/* -------- MLB_MADR : (MLB Offset: 0xE4) (R/W 32) MIF Address Register -------- */
#define MLB_MADR_ADDR_Pos                     _U_(0)                                               /**< (MLB_MADR) CTR or DBR Address Position */
#define MLB_MADR_ADDR_Msk                     (_U_(0x3FFF) << MLB_MADR_ADDR_Pos)                   /**< (MLB_MADR) CTR or DBR Address Mask */
#define MLB_MADR_ADDR(value)                  (MLB_MADR_ADDR_Msk & ((value) << MLB_MADR_ADDR_Pos))
#define MLB_MADR_TB_Pos                       _U_(30)                                              /**< (MLB_MADR) Target Location Bit Position */
#define MLB_MADR_TB_Msk                       (_U_(0x1) << MLB_MADR_TB_Pos)                        /**< (MLB_MADR) Target Location Bit Mask */
#define MLB_MADR_TB(value)                    (MLB_MADR_TB_Msk & ((value) << MLB_MADR_TB_Pos))    
#define   MLB_MADR_TB_CTR_Val                 _U_(0x0)                                             /**< (MLB_MADR) Selects CTR  */
#define   MLB_MADR_TB_DBR_Val                 _U_(0x1)                                             /**< (MLB_MADR) Selects DBR  */
#define MLB_MADR_TB_CTR                       (MLB_MADR_TB_CTR_Val << MLB_MADR_TB_Pos)             /**< (MLB_MADR) Selects CTR Position  */
#define MLB_MADR_TB_DBR                       (MLB_MADR_TB_DBR_Val << MLB_MADR_TB_Pos)             /**< (MLB_MADR) Selects DBR Position  */
#define MLB_MADR_WNR_Pos                      _U_(31)                                              /**< (MLB_MADR) Write-Not-Read Selection Position */
#define MLB_MADR_WNR_Msk                      (_U_(0x1) << MLB_MADR_WNR_Pos)                       /**< (MLB_MADR) Write-Not-Read Selection Mask */
#define MLB_MADR_WNR(value)                   (MLB_MADR_WNR_Msk & ((value) << MLB_MADR_WNR_Pos))  
#define MLB_MADR_Msk                          _U_(0xC0003FFF)                                      /**< (MLB_MADR) Register Mask  */


/* -------- MLB_ACTL : (MLB Offset: 0x3C0) (R/W 32) AHB Control Register -------- */
#define MLB_ACTL_SCE_Pos                      _U_(0)                                               /**< (MLB_ACTL) Software Clear Enable Position */
#define MLB_ACTL_SCE_Msk                      (_U_(0x1) << MLB_ACTL_SCE_Pos)                       /**< (MLB_ACTL) Software Clear Enable Mask */
#define MLB_ACTL_SCE(value)                   (MLB_ACTL_SCE_Msk & ((value) << MLB_ACTL_SCE_Pos))  
#define MLB_ACTL_SMX_Pos                      _U_(1)                                               /**< (MLB_ACTL) AHB Interrupt Mux Enable Position */
#define MLB_ACTL_SMX_Msk                      (_U_(0x1) << MLB_ACTL_SMX_Pos)                       /**< (MLB_ACTL) AHB Interrupt Mux Enable Mask */
#define MLB_ACTL_SMX(value)                   (MLB_ACTL_SMX_Msk & ((value) << MLB_ACTL_SMX_Pos))  
#define MLB_ACTL_DMA_MODE_Pos                 _U_(2)                                               /**< (MLB_ACTL) DMA Mode Position */
#define MLB_ACTL_DMA_MODE_Msk                 (_U_(0x1) << MLB_ACTL_DMA_MODE_Pos)                  /**< (MLB_ACTL) DMA Mode Mask */
#define MLB_ACTL_DMA_MODE(value)              (MLB_ACTL_DMA_MODE_Msk & ((value) << MLB_ACTL_DMA_MODE_Pos))
#define MLB_ACTL_MPB_Pos                      _U_(4)                                               /**< (MLB_ACTL) DMA Packet Buffering Mode Position */
#define MLB_ACTL_MPB_Msk                      (_U_(0x1) << MLB_ACTL_MPB_Pos)                       /**< (MLB_ACTL) DMA Packet Buffering Mode Mask */
#define MLB_ACTL_MPB(value)                   (MLB_ACTL_MPB_Msk & ((value) << MLB_ACTL_MPB_Pos))  
#define   MLB_ACTL_MPB_SINGLE_PACKET_Val      _U_(0x0)                                             /**< (MLB_ACTL) Single-packet mode  */
#define   MLB_ACTL_MPB_MULTIPLE_PACKET_Val    _U_(0x1)                                             /**< (MLB_ACTL) Multiple-packet mode  */
#define MLB_ACTL_MPB_SINGLE_PACKET            (MLB_ACTL_MPB_SINGLE_PACKET_Val << MLB_ACTL_MPB_Pos) /**< (MLB_ACTL) Single-packet mode Position  */
#define MLB_ACTL_MPB_MULTIPLE_PACKET          (MLB_ACTL_MPB_MULTIPLE_PACKET_Val << MLB_ACTL_MPB_Pos) /**< (MLB_ACTL) Multiple-packet mode Position  */
#define MLB_ACTL_Msk                          _U_(0x00000017)                                      /**< (MLB_ACTL) Register Mask  */


/* -------- MLB_ACSR : (MLB Offset: 0x3D0) (R/W 32) AHB Channel Status 0 Register 0 -------- */
#define MLB_ACSR_CHS_Pos                      _U_(0)                                               /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Position */
#define MLB_ACSR_CHS_Msk                      (_U_(0xFFFFFFFF) << MLB_ACSR_CHS_Pos)                /**< (MLB_ACSR) Interrupt Status for Logical Channels [31:0] (cleared by writing a 1) Mask */
#define MLB_ACSR_CHS(value)                   (MLB_ACSR_CHS_Msk & ((value) << MLB_ACSR_CHS_Pos))  
#define MLB_ACSR_Msk                          _U_(0xFFFFFFFF)                                      /**< (MLB_ACSR) Register Mask  */


